
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>개요 · TrainDB Documentation</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-versions-select/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="TUTORIAL.html" />
    
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    
    
        
        <li>
            <a href="https://github.com/traindb-project" target="_blank" class="custom-link">TrainDB Project</a>
        </li>
    
    

    
    <li class="divider"></li>
    

    
        
        
    
        <li class="chapter active" data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    개요
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="TUTORIAL.html">
            
                <a href="TUTORIAL.html">
            
                    
                    튜토리얼
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="tutorial/GETTING_STARTED.html">
            
                <a href="tutorial/GETTING_STARTED.html">
            
                    
                    시작하기
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="tutorial/EXAMPLES_CLI.html">
            
                <a href="tutorial/EXAMPLES_CLI.html">
            
                    
                    CLI 사용 예
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="tutorial/EXAMPLES_JDBC.html">
            
                <a href="tutorial/EXAMPLES_JDBC.html">
            
                    
                    JDBC 사용 예
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="SQL.html">
            
                <a href="SQL.html">
            
                    
                    SQL 참조 안내서
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="sql/CREATE_MODEL.html">
            
                <a href="sql/CREATE_MODEL.html">
            
                    
                    CREATE MODEL
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="sql/CREATE_SYNOPSIS.html">
            
                <a href="sql/CREATE_SYNOPSIS.html">
            
                    
                    CREATE SYNOPSIS
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="sql/DROP_MODEL.html">
            
                <a href="sql/DROP_MODEL.html">
            
                    
                    DROP MODEL
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.4" data-path="sql/DROP_MODEL_INSTANCE.html">
            
                <a href="sql/DROP_MODEL_INSTANCE.html">
            
                    
                    DROP MODEL INSTANCE
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.5" data-path="sql/DROP_SYNOPSIS.html">
            
                <a href="sql/DROP_SYNOPSIS.html">
            
                    
                    DROP SYNOPSIS
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.6" data-path="sql/SHOW.html">
            
                <a href="sql/SHOW.html">
            
                    
                    SHOW
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.7" data-path="sql/TRAIN_MODEL_INSTANCE.html">
            
                <a href="sql/TRAIN_MODEL_INSTANCE.html">
            
                    
                    TRAIN MODEL INSTANCE
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="DEV_GUIDE.html">
            
                <a href="DEV_GUIDE.html">
            
                    
                    개발자 안내
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="dev_guide/SQL_REG_TEST.html">
            
                <a href="dev_guide/SQL_REG_TEST.html">
            
                    
                    SQL 회귀 테스트 실행 방법
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="dev_guide/CODING_STYLE_GUIDE.html">
            
                <a href="dev_guide/CODING_STYLE_GUIDE.html">
            
                    
                    코딩 스타일 가이드
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.3" data-path="dev_guide/GITBOOK_MANUAL.html">
            
                <a href="dev_guide/GITBOOK_MANUAL.html">
            
                    
                    GitBook 문서화 방법
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >개요</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#xAC1C;&#xC694;">&#xAC1C;&#xC694;</h1>
<h2 id="traindb&#xB780;">TrainDB&#xB780;?</h2>
<p>&#xBE45;&#xB370;&#xC774;&#xD130; &#xB300;&#xC0C1;&#xC758; &#xBE60;&#xB978; &#xC9C8;&#xC758; &#xCC98;&#xB9AC;&#xAC00; &#xAC00;&#xB2A5;&#xD55C; &#xD0D0;&#xC0AC; &#xB370;&#xC774;&#xD130; &#xBD84;&#xC11D; &#xC9C0;&#xC6D0; &#xADFC;&#xC0AC;&#xC9C8;&#xC758; DBMS &#xC2DC;&#xC2A4;&#xD15C;&#xC744; &#xB9D0;&#xD55C;&#xB2E4;. 2000&#xB144;&#xB300; &#xC774;&#xD6C4; &#xBE45;&#xB370;&#xC774;&#xD130;&#xB97C; &#xBD84;&#xC11D;&#xD558;&#xC5EC; &#xD655;&#xC2E4;&#xD55C; &#xADFC;&#xAC70;&#xB97C; &#xD655;&#xC778;&#xD55C; &#xB2E4;&#xC74C;&#xC5D0; &#xBE44;&#xC988;&#xB2C8;&#xC2A4; &#xC758;&#xC0AC; &#xACB0;&#xC815;&#xC744; &#xB0B4;&#xB9AC;&#xB294; &#xB370;&#xC774;&#xD130; &#xAE30;&#xBC18; &#xC758;&#xC0AC; &#xACB0;&#xC815;&#xC774; &#xC911;&#xC694;&#xD574;&#xC84C;&#xB2E4;. &#xADF8;&#xB7F0;&#xB370; &#xB370;&#xC774;&#xD130;&#xAC00; &#xC0DD;&#xC131;, &#xC218;&#xC9D1;&#xB418;&#xB294; &#xC18D;&#xB3C4;&#xAC00; &#xB370;&#xC774;&#xD130; &#xBD84;&#xC11D; &#xC18D;&#xB3C4;&#xB97C; &#xC555;&#xB3C4;&#xC801;&#xC73C;&#xB85C; &#xCD94;&#xC6D4;&#xD558;&#xB2E4; &#xBCF4;&#xB2C8; &#xC6D0;&#xD558;&#xB294; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC801;&#xC2DC;&#xC5D0; &#xBD84;&#xC11D;&#xD558;&#xAE30;&#xAC00; &#xC5B4;&#xB824;&#xC6CC;&#xC9C0;&#xACE0; &#xC788;&#xB2E4;. &#xC77C;&#xB840;&#xB85C; &#xC81C;&#xC870; &#xD604;&#xC7A5;&#xC5D0;&#xC11C;&#xB294; &#xD558;&#xB8E8;&#xC5D0; &#xC218;&#xC2ED; TB&#xC758; &#xB370;&#xC774;&#xD130;&#xAC00; &#xC0DD;&#xC131;&#xB418;&#xACE0; &#xC788;&#xACE0;, &#xBAA8; &#xACF5;&#xB2E8;&#xC5D0;&#xC11C;&#xB294; &#xC6D4;&#xBCC4;&#xB85C; &#xC9C4;&#xB8CC;&#xBE44;&#xB97C; &#xC2EC;&#xC0AC;&#xD558;&#xAE30; &#xC704;&#xD55C; &#xB370;&#xC774;&#xD130;&#xAC00; 10 TB&#xC5D0; &#xC774;&#xB974;&#xB7EC; &#xBD84;&#xC11D; &#xC9C8;&#xC758;&#xB97C; &#xC218;&#xD589;&#xD558;&#xB294; &#xB370; &#xC218;&#xC2ED; &#xC2DC;&#xAC04;&#xAE4C;&#xC9C0; &#xAC78;&#xB9AC;&#xACE0; &#xC788;&#xB2E4;. &#xC774;&#xB7F0; &#xBD84;&#xC11D; &#xC2DC;&#xAC04;&#xC744; &#xC904;&#xC774;&#xAE30; &#xC704;&#xD574; &#xC778;&#xBA54;&#xBAA8;&#xB9AC; &#xCEF4;&#xD4E8;&#xD305;&#xC774;&#xB098; &#xBCD1;&#xB82C; &#xCC98;&#xB9AC; &#xB4F1; HW&#xB97C; &#xD65C;&#xC6A9;&#xD55C; &#xACE0;&#xC131;&#xB2A5; &#xAE30;&#xC220;&#xC744; &#xC801;&#xC6A9;&#xD558;&#xB824;&#xB294; &#xC2DC;&#xB3C4;&#xB4E4;&#xB3C4; &#xC788;&#xC9C0;&#xB9CC;, &#xCEF4;&#xD4E8;&#xD305; &#xC790;&#xC6D0; &#xC0AC;&#xC6A9;&#xB7C9;&#xC774; &#xB9CE;&#xC544;&#xC838; &#xBE44;&#xC6A9;&#xC774; &#xC99D;&#xAC00;&#xD558;&#xB294; &#xBB38;&#xC81C;&#xAC00; &#xBC1C;&#xC0DD;&#xD558;&#xAC8C; &#xB41C;&#xB2E4;. &#xADF8;&#xB807;&#xB2E4; &#xBCF4;&#xB2C8; &#xBE44;&#xC988;&#xB2C8;&#xC2A4; &#xC758;&#xC0AC; &#xACB0;&#xC815;&#xC758; &#xC801;&#xC2DC;&#xC131;&#xC744; &#xD655;&#xBCF4;&#xD558;&#xB294; &#xC0C8;&#xB85C;&#xC6B4; &#xBC29;&#xC548;&#xC774; &#xD544;&#xC694;&#xD558;&#xAC8C; &#xB418;&#xC5C8;&#xACE0;, &#xADF8; &#xD574;&#xACB0; &#xBC29;&#xC548;&#xC73C;&#xB85C; &#xB370;&#xC774;&#xD130; &#xBD84;&#xC11D;&#xC758; &#xC815;&#xD655;&#xB3C4;&#xB97C; &#xC870;&#xAE08; &#xB0AE;&#xCD94;&#xB294; &#xB300;&#xC2E0; &#xACB0;&#xACFC;&#xB97C; &#xBE60;&#xB974;&#xAC8C; &#xC5BB;&#xC744; &#xC218; &#xC788;&#xB294; &#xADFC;&#xC0AC; &#xC9C8;&#xC758; &#xBD84;&#xC57C;&#xC758; &#xC5F0;&#xAD6C;&#xB97C; &#xC0DD;&#xAC01;&#xD574; &#xBCFC; &#xC218; &#xC788;&#xB2E4;. &#xAE30;&#xC874;&#xC758; &#xC694;&#xC57D; &#xAE30;&#xBC18; &#xADFC;&#xC0AC; &#xC9C8;&#xC758; &#xCC98;&#xB9AC; &#xBC29;&#xC2DD;&#xC740; &#xC5B4;&#xB5A4; &#xC815;&#xD574;&#xC9C4; &#xC720;&#xD615;&#xC758; &#xC9C8;&#xC758;&#xB97C; &#xD6A8;&#xC728;&#xC801;&#xC73C;&#xB85C; &#xC751;&#xB2F5;&#xD560; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xC694;&#xC57D; &#xC815;&#xBCF4;&#xB97C; &#xC0DD;&#xC131;&#xD558;&#xAC70;&#xB098;, &#xC0D8;&#xD50C; &#xB370;&#xC774;&#xD130;&#xB97C; &#xB2E4;&#xC591;&#xD558;&#xAC8C; &#xB9CC;&#xB4E4;&#xC5B4; &#xB193;&#xACE0; &#xC77C;&#xBC18;&#xC801;&#xC778; &#xADFC;&#xC0AC; &#xC9C8;&#xC758;&#xB97C; &#xC9C0;&#xC6D0;&#xD558;&#xB294; &#xD615;&#xD0DC;&#xC774;&#xC5B4;&#xC11C;, &#xBBF8;&#xB9AC; &#xC720;&#xD615;&#xC774; &#xC815;&#xD574;&#xC838; &#xC788;&#xB294; &#xBD84;&#xC11D;&#xC5D0;&#xB294; &#xC798; &#xB9DE;&#xB294; &#xBC18;&#xBA74;&#xC5D0;, &#xB3D9;&#xC801;&#xC73C;&#xB85C; &#xB370;&#xC774;&#xD130;&#xB97C; &#xD0D0;&#xC0C9;&#xD558;&#xB294; &#xC2A4;&#xD0C0;&#xC77C;&#xC758; &#xBD84;&#xC11D;&#xC744; &#xC9C0;&#xC6D0;&#xD558;&#xB294; &#xB370;&#xB294; &#xD55C;&#xACC4;&#xAC00; &#xC788;&#xB2E4;. &#xADF8;&#xB798;&#xC11C; &#xADDC;&#xBAA8;&#xAC00; &#xD070; &#xB370;&#xC774;&#xD130;&#xC5D0; &#xB300;&#xD574;&#xC11C;&#xB3C4; &#xC77C;&#xC815; &#xC218;&#xC900;&#xC758; &#xC9C8;&#xC758; &#xC751;&#xB2F5; &#xC2DC;&#xAC04;&#xACFC; &#xC815;&#xD655;&#xB3C4;&#xB97C; &#xD655;&#xBCF4;&#xD558;&#xBA74;&#xC11C; &#xB3D9;&#xC801;&#xC778; &#xD0D0;&#xC0AC; &#xB370;&#xC774;&#xD130; &#xBD84;&#xC11D;&#xC744; &#xC9C0;&#xC6D0;&#xD558;&#xB824;&#xB294; &#xAC83;&#xC774; &#xBC14;&#xB85C; &#xBA38;&#xC2E0; &#xB7EC;&#xB2DD; &#xAE30;&#xBC18; DBMS &#xADFC;&#xC0AC; &#xC9C8;&#xC758; &#xCC98;&#xB9AC; &#xC5D4;&#xC9C4; &#xAE30;&#xC220;, TrainDB&#xC774;&#xB2E4;.</p>
<h2 id="traindb-&#xC8FC;&#xC694;-&#xAC1C;&#xBC1C;-&#xBAA9;&#xD45C;">TrainDB &#xC8FC;&#xC694; &#xAC1C;&#xBC1C; &#xBAA9;&#xD45C;</h2>
<p>TrainDB&#xC758; &#xC8FC;&#xC694; &#xAC1C;&#xBC1C; &#xBAA9;&#xD45C;&#xB294; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xB2E4;.</p>
<ul>
<li>&#xAE30;&#xC874; &#xADFC;&#xC0AC; &#xC9C8;&#xC758; &#xCC98;&#xB9AC; &#xAE30;&#xC220;&#xC758; &#xD55C;&#xACC4; &#xADF9;&#xBCF5;<ul>
<li>&#xAE30;&#xC874; &#xC0D8;&#xD50C;&#xB9C1;, &#xD788;&#xC2A4;&#xD1A0;&#xADF8;&#xB7A8;, &#xC6E8;&#xC774;&#xBE14;&#xB9BF;, &#xC2A4;&#xCF00;&#xCE58; &#xB4F1; &#xC804;&#xD1B5;&#xC801;&#xC778; &#xC694;&#xC57D; &#xC815;&#xBCF4; &#xAE30;&#xBC18; &#xADFC;&#xC0AC; &#xC9C8;&#xC758; &#xCC98;&#xB9AC; &#xAE30;&#xC220;&#xACFC; &#xAC19;&#xC774; &#xC9C8;&#xC758; &#xCEE4;&#xBC84;&#xB9AC;&#xC9C0;&#xAC00; &#xB0AE;&#xACE0; &#xB370;&#xC774;&#xD130; &#xBCC0;&#xACBD; &#xC2DC; &#xBC18;&#xC601;&#xC774; &#xC5B4;&#xB824;&#xC6B4; &#xAE30;&#xC220;&#xC801; &#xD55C;&#xACC4; &#xADF9;&#xBCF5;</li>
</ul>
</li>
<li>&#xB370;&#xC774;&#xD130; &#xC801;&#xC2DC; &#xBD84;&#xC11D; &#xC9C0;&#xC6D0;<ul>
<li>&#xBD84;&#xC11D; &#xC2DC;&#xAC04;&#xC774; &#xB370;&#xC774;&#xD130; &#xD06C;&#xAE30;&#xC5D0; &#xBE44;&#xB840;&#xD558;&#xB294; &#xAE30;&#xC874; &#xBD84;&#xC11D; &#xAE30;&#xC220;&#xB85C; &#xD574;&#xACB0;&#xD558;&#xAE30; &#xC5B4;&#xB824;&#xC6B4; &#xBB38;&#xC81C; &#xD574;&#xACB0; &#xAE30;&#xC220; &#xC81C;&#xACF5;</li>
<li>&#xC804;&#xCCB4; &#xB370;&#xC774;&#xD130;&#xC5D0; &#xB300;&#xD55C; &#xC815;&#xD655;&#xD55C; &#xBD84;&#xC11D; &#xACB0;&#xACFC;&#xB97C; &#xC801;&#xC2DC;&#xC5D0; &#xD68D;&#xB4DD;&#xD560; &#xC218; &#xC788;&#xB294; &#xD0D0;&#xC0AC;&#xB370;&#xC774;&#xD130; &#xBD84;&#xC11D; &#xAE30;&#xC220; &#xC9C0;&#xC6D0;</li>
</ul>
</li>
<li>&#xBA38;&#xC2E0; &#xB7EC;&#xB2DD; &#xAE30;&#xBC18; &#xADFC;&#xC0AC; &#xC9C8;&#xC758; &#xCC98;&#xB9AC; &#xAE30;&#xC220; &#xC9C0;&#xC6D0;<ul>
<li>&#xB370;&#xC774;&#xD130; &#xADDC;&#xBAA8;&#xC758; &#xC99D;&#xAC00;&#xC5D0;&#xB3C4; &#xC77C;&#xC815; &#xC218;&#xC900;&#xC758; &#xC9C8;&#xC758; &#xCC98;&#xB9AC; &#xC751;&#xB2F5; &#xC2DC;&#xAC04;&#xC744; &#xC720;&#xC9C0;&#xD560; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xBA38;&#xC2E0; &#xB7EC;&#xB2DD;(ML)&#xC744; &#xD65C;&#xC6A9;&#xD558;&#xC5EC; &#xC9C8;&#xC758; &#xCC98;&#xB9AC; &#xACB0;&#xACFC;&#xC758; &#xBD80;&#xC815;&#xD655;&#xC131; &#xD574;&#xACB0;</li>
</ul>
</li>
<li>&#xD65C;&#xC6A9;&#xC131; &#xC99D;&#xB300;<ul>
<li>&#xD074;&#xB77C;&#xC6B0;&#xB4DC;/&#xD3EC;&#xD130;&#xBE14; &#xD638;&#xC2A4;&#xD305; &#xD658;&#xACBD;&#xC5D0;&#xC11C; &#xB370;&#xC774;&#xD130; &#xBE44;&#xC811;&#xADFC; &#xC9C8;&#xC758; &#xCC98;&#xB9AC; &#xC81C;&#xACF5;</li>
<li>&#xB2E4;&#xC591;&#xD55C; DBMS &#xB370;&#xC774;&#xD130; &#xC18C;&#xC2A4;&#xB85C;&#xBD80;&#xD130; &#xBA38;&#xC2E0; &#xB7EC;&#xB2DD;(ML) &#xBAA8;&#xB378;&#xC744; &#xD559;&#xC2B5;&#xD574;&#xC11C; &#xADFC;&#xC0AC; &#xC9C8;&#xC758;&#xB97C; &#xC81C;&#xACF5;&#xD558;&#xB294; &#xB370;&#xC774;&#xD130; &#xC18C;&#xC2A4; &#xD655;&#xC7A5;&#xD615; &#xADFC;&#xC0AC; &#xC9C8;&#xC758; &#xCC98;&#xB9AC; &#xC9C0;&#xC6D0;</li>
</ul>
</li>
</ul>
<h2 id="traindb-&#xC544;&#xD0A4;&#xD14D;&#xCC98;">TrainDB &#xC544;&#xD0A4;&#xD14D;&#xCC98;</h2>
<p>TrainDB &#xC2DC;&#xC2A4;&#xD15C;&#xC740; 4&#xAC1C;&#xC758; SW, &#xC989; &#xB370;&#xC774;&#xD130; &#xBE44;&#xC811;&#xADFC; &#xC9C8;&#xC758; &#xCC98;&#xB9AC;&#xB97C; &#xC704;&#xD55C; &#xBA38;&#xC2E0; &#xB7EC;&#xB2DD; &#xBAA8;&#xB378; &#xAD6C;&#xCD95; &#xBC0F; &#xAD00;&#xB9AC; &#xBE14;&#xB85D;, ML &#xBAA8;&#xB378; &#xAE30;&#xBC18; DBMS &#xADFC;&#xC0AC; &#xC9C8;&#xC758; &#xBCC0;&#xD658; &#xBC0F; &#xCD5C;&#xC801;&#xD654; &#xBE14;&#xB85D;, &#xB370;&#xC774;&#xD130; &#xC18C;&#xC2A4; &#xD655;&#xC7A5;&#xD615; &#xADFC;&#xC0AC; &#xC9C8;&#xC758; &#xCC98;&#xB9AC; &#xBE14;&#xB85D;, &#xADFC;&#xC0AC; &#xC9C8;&#xC758; &#xCC98;&#xB9AC; &#xC5D4;&#xC9C4; &#xC5F0;&#xB3D9; &#xD0D0;&#xC0AC; &#xB370;&#xC774;&#xD130; &#xBD84;&#xC11D; &#xC9C0;&#xC6D0; &#xBE14;&#xB85D;&#xC73C;&#xB85C; &#xAD6C;&#xC131;&#xB41C;&#xB2E4;.</p>
<ol>
<li>&#xB370;&#xC774;&#xD130; &#xBE44;&#xC811;&#xADFC; &#xC9C8;&#xC758; &#xCC98;&#xB9AC;&#xB97C; &#xC704;&#xD55C; &#xBA38;&#xC2E0; &#xB7EC;&#xB2DD; &#xBAA8;&#xB378; &#xAD6C;&#xCD95; &#xBC0F; &#xAD00;&#xB9AC; &#xBE14;&#xB85D;<ul>
<li>&#xB2E4;&#xC591;&#xD55C; &#xBD84;&#xC11D;/&#xC9D1;&#xACC4; &#xC5F0;&#xC0B0;&#xC744; &#xC9C0;&#xC6D0;&#xD558;&#xAE30; &#xC704;&#xD574;, &#xC6D0;&#xC2DC; &#xB370;&#xC774;&#xD130;&#xB85C;&#xBD80;&#xD130; &#xBA38;&#xC2E0; &#xB7EC;&#xB2DD;(ML) &#xBAA8;&#xB378;&#xC744; &#xAD6C;&#xCD95;&#xD558;&#xC5EC; &#xC9C8;&#xC758; &#xCC98;&#xB9AC; &#xC2DC; &#xC6D0;&#xC2DC; &#xB370;&#xC774;&#xD130;&#xC5D0; &#xC811;&#xADFC;&#xD558;&#xC9C0; &#xC54A;&#xACE0;, ML &#xBAA8;&#xB378;&#xB9CC;&#xC744; &#xC774;&#xC6A9;&#xD574;&#xC11C; &#xB370;&#xC774;&#xD130; &#xC2DC;&#xB189;&#xC2DC;&#xC2A4; &#xC0DD;&#xC131; &#xB610;&#xB294; &#xC9C8;&#xC758; &#xACB0;&#xACFC;&#xB97C; &#xCD94;&#xB860; &#xAE30;&#xB2A5;&#xC744; &#xC81C;&#xACF5;&#xD558;&#xB294; &#xBE14;&#xB85D;</li>
</ul>
</li>
<li>&#xBA38;&#xC2E0; &#xB7EC;&#xB2DD; &#xBAA8;&#xB378; &#xAE30;&#xBC18; DBMS &#xADFC;&#xC0AC; &#xC9C8;&#xC758; &#xBCC0;&#xD658; &#xBC0F; &#xCD5C;&#xC801;&#xD654; &#xBE14;&#xB85D;<ul>
<li>&#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xADFC;&#xC0AC; &#xC9C8;&#xC758;&#xB97C; &#xD45C;&#xD604;&#xD560; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xC9C8;&#xC758; &#xC5B8;&#xC5B4;&#xB97C; &#xD655;&#xC7A5;&#xD558;&#xACE0;, &#xADFC;&#xC0AC; &#xC9C8;&#xC758;&#xBB38;&#xC744; &#xBD84;&#xC11D;&#xD574;&#xC11C; &#xD6A8;&#xC728;&#xC801;&#xC73C;&#xB85C; &#xCC98;&#xB9AC;&#xD558;&#xB294; &#xC2E4;&#xD589; &#xACC4;&#xD68D;&#xC744; &#xC218;&#xB9BD;&#xD558;&#xB294; &#xBE14;&#xB85D;</li>
</ul>
</li>
<li>&#xB370;&#xC774;&#xD130; &#xC18C;&#xC2A4; &#xD655;&#xC7A5;&#xD615; &#xADFC;&#xC0AC; &#xC9C8;&#xC758; &#xCC98;&#xB9AC; &#xBE14;&#xB85D;<ul>
<li>&#xAD6D;&#xB0B4;&#xC678; &#xC0C1;&#xC6A9; DBMS &#xBC0F; &#xD074;&#xB77C;&#xC6B0;&#xB4DC; DBMS&#xC640; &#xC5F0;&#xB3D9;&#xD574;&#xC11C; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xB370;&#xC774;&#xD130; &#xC18C;&#xC2A4;&#xB97C; &#xD655;&#xC7A5;&#xD615;&#xC73C;&#xB85C; &#xC5F0;&#xB3D9;&#xD558;&#xACE0;, &#xC6D0;&#xC2DC; DBMS &#xC9C8;&#xC758;&#xC640; &#xADFC;&#xC0AC; &#xC9C8;&#xC758;&#xB97C; &#xD1B5;&#xD569;&#xD558;&#xC5EC; &#xC2E4;&#xD589;&#xD558;&#xB294; &#xBE14;&#xB85D;</li>
</ul>
</li>
<li>&#xADFC;&#xC0AC; &#xC9C8;&#xC758; &#xCC98;&#xB9AC; &#xC2DC;&#xC2A4;&#xD15C; &#xC5F0;&#xB3D9; &#xD0D0;&#xC0AC; &#xB370;&#xC774;&#xD130; &#xBD84;&#xC11D; &#xC9C0;&#xC6D0; &#xBE14;&#xB85D;<ul>
<li>&#xBD84;&#xC11D; &#xC751;&#xC6A9;&#xC5D0;&#xC11C; &#xC2DC;&#xAC01;&#xC801;&#xC73C;&#xB85C; &#xD0D0;&#xC0AC; &#xB370;&#xC774;&#xD130; &#xBD84;&#xC11D;&#xC744; &#xC218;&#xD589;&#xD560; &#xC218; &#xC788;&#xB294; &#xC9C0;&#xC6D0; &#xB3C4;&#xAD6C;&#xC640; ML &#xBAA8;&#xB378; &#xC790;&#xB3D9; &#xD559;&#xC2B5; &#xBC0F; &#xB9C8;&#xC774;&#xADF8;&#xB808;&#xC774;&#xC158; &#xB4F1; &#xADFC;&#xC0AC; &#xC9C8;&#xC758; &#xCC98;&#xB9AC;&#xB97C; &#xAD00;&#xB9AC;&#xD560; &#xC218; &#xC788;&#xB294; &#xC6CC;&#xD06C;&#xBCA4;&#xCE58;&#xB97C; &#xC81C;&#xACF5;&#xD574;&#xC8FC;&#xB294; &#xBE14;&#xB85D;</li>
</ul>
</li>
</ol>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                
                <a href="TUTORIAL.html" class="navigation navigation-next navigation-unique" aria-label="Next page: 튜토리얼">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"개요","level":"1.1","depth":1,"next":{"title":"튜토리얼","level":"1.2","depth":1,"path":"TUTORIAL.md","ref":"TUTORIAL.md","articles":[{"title":"시작하기","level":"1.2.1","depth":2,"path":"tutorial/GETTING_STARTED.md","ref":"tutorial/GETTING_STARTED.md","articles":[]},{"title":"CLI 사용 예","level":"1.2.2","depth":2,"path":"tutorial/EXAMPLES_CLI.md","ref":"tutorial/EXAMPLES_CLI.md","articles":[]},{"title":"JDBC 사용 예","level":"1.2.3","depth":2,"path":"tutorial/EXAMPLES_JDBC.md","ref":"tutorial/EXAMPLES_JDBC.md","articles":[]}]},"dir":"ltr"},"config":{"plugins":["versions-select"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"versions-select":{"type":"branches"},"fontsettings":{"theme":"white","family":"sans","size":2},"fontSettings":{"theme":"night","family":"sans","size":2},"highlight":{},"versions":{"options":[{"value":"https://traindb-project.github.io/traindb-doc/ko/","text":"TrainDB v0.5","selected":true},{"value":"https://traindb-project.github.io/traindb-doc/ko/0.2","text":"TrainDB v0.2"}]},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","pdf":{"pageBreaksBefore":"/","headerTemplate":null,"paperSize":"a4","margin":{"right":62,"left":62,"top":36,"bottom":36},"fontSize":12,"fontFamily":"Arial","footerTemplate":null,"chapterMark":"pagebreak","pageNumbers":false},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"isbn":"","variables":{},"title":"TrainDB Documentation","links":{"sidebar":{"TrainDB Project":"https://github.com/traindb-project"}},"gitbook":"*","description":"TrainDB Documentation","extension":null},"file":{"path":"README.md","mtime":"2022-08-16T16:54:59.487Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2022-08-17T01:31:53.525Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-versions-select/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

